idrey/CC3200_Onenet/main.c
            }
            if(iConnBroker < 1)
            {
                //
                // device not connected to any broker
                //
                goto end;
            }
        }

        if(flag_red == 1) {
            UtilsDelay(8000000*10);
            temp_die = ProcessReadRegCommand(regTemp);
            temp = (float)(temp_die >> 2)*0.03125;
            sprintf(temp_str, "%.2f", temp);
            UART_PRINT("Temp is %s\r\n", temp_str);
            data_sw2 = (unsigned char*)getJson(temp_str);
            sl_ExtLib_MqttClientSend((void*)local_con_conf[iCount].clt_ctx,
                    pub_topic_sw2,data_sw2,strlen((char*)data_sw2),QOS1,RETAIN);
            UART_PRINT("\n\r CC3200 Publishes the following message \n\r");
            UART_PRINT("Topic: %s\n\r",pub_topic_sw2);
            UART_PRINT("Data: %s\n\r",data_sw2);
        }
    }
end:
    //
    // Deinitializating the client library
    //

	sl_ExtLib_MqttClientExit();
    UART_PRINT("\n\r Exiting the Application\n\r");
    
    LOOP_FOREVER();
}

//*****************************************************************************
//
//! Main 
//!
//! \param  none
//!
//! This function
//!    1. Invokes the SLHost task
//!    2. Invokes the MqttClient
//!
//! \return None
//!
//*****************************************************************************
void main()
{ 
    long lRetVal = -1;
    //
    // Initialize the board configurations
    //
    BoardInit();

    //
    // Pinmux for UART
    //
    PinMuxConfig();

    //
    // Configuring UART
    //
    InitTerm();

    //
    // Display Application Banner
    //
    DisplayBanner("MQTT_Client");
    I2C_IF_Open(I2C_MASTER_MODE_FST);
    //
    // Start the SimpleLink Host
    //
    lRetVal = VStartSimpleLinkSpawnTask(SPAWN_TASK_PRIORITY);
    if(lRetVal < 0)
    {
        ERR_PRINT(lRetVal);
        LOOP_FOREVER();
    }

    //
    // Start the MQTT Client task
    //
    osi_MsgQCreate(&g_PBQueue,"PBQueue",sizeof(event_msg),10);
    lRetVal = osi_TaskCreate(MqttClient,
                            (const signed char *)"Mqtt Client App",
                            OSI_STACK_SIZE, NULL, 2, NULL );

    if(lRetVal < 0)
    {
        ERR_PRINT(lRetVal);
        LOOP_FOREVER();
    }
    //
    // Start the task scheduler
    //
    osi_start();
}

//需要修改
char *getJson(char* temp) {
    cJSON* cjson_test = NULL;
    cJSON* cjson_dp = NULL;
    cJSON* cjson_temp = NULL;
    cJSON* cjson_v = NULL;

    /* ´´½¨Ò»¸öJSONÊý¾Ý¶ÔÏó(Á´±íÍ·½áµã) */
    cjson_test = cJSON_CreateObject();

    /* Ìí¼ÓÒ»Ìõ×Ö·û´®ÀàÐÍµÄJSONÊý¾Ý(Ìí¼ÓÒ»¸öÁ´±í½Úµã) */
    cJSON_AddNumberToObject(cjson_test, "id", 123);


    cjson_dp = cJSON_CreateObject();

    cjson_v = cJSON_CreateObject();
    cJSON_AddStringToObject(cjson_v, "v", temp);

    cjson_temp = cJSON_CreateArray();
    cJSON_AddItemToArray(cjson_temp, cjson_v);
    cJSON_AddItemToObject(cjson_dp, "temp", cjson_temp);

    cJSON_AddItemToObject(cjson_test, "dp", cjson_dp);

    return cJSON_Print(cjson_test);
}

